Tekla Open API Reference for Tekla Structures 2025
BoltItem.Type Property
 The bolt item's type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltItem.BoltItemTypeEnum Type { get; set; }
Public Property Type As BoltItem.BoltItemTypeEnum
	Get
	Set
Property Value
Type: BoltItem.BoltItemTypeEnum
See Also
Reference
BoltItem Class
Tekla.Structures.Catalogs Namespace